package com.sse.tangpoetry.constant;

/**
 * @name: BaseConstant
 * @author: yf.xiang
 * @create: 2020-01-20 18:50
 * @description:
 */
public class BaseConstant {
    public static final String TANGPOETRY_INTRO = "古诗是中华民族乃至全世界的瑰宝, 我们应该传承下去,此数据库共收录全唐诗共计43030首," +
            "其中收集唐朝诗人写诗最多的人如下：白居易、杜甫、李白、佚名、齐己、刘禹锡、元稹、李商隐、贯休、韦应物" +
            "《全唐诗》是清康熙四十四年（1705年），彭定求、沈三曾、杨中讷、汪士鋐、汪绎、俞梅、徐树本、车鼎晋、潘从律、查嗣瑮等十人奉敕编校，“得诗四万八千九百余首，凡二千二百余人”， [1]  共计900卷，目录13卷。" +
            "全唐诗的编修过程是这样的：康熙四十二年(1703年)，清圣祖玄烨即考虑编纂此书，至四十四年(1705年)三月，" +
            "他第五次南巡至苏州时，将主持修书的任务交给江宁织造曹寅，并将内府所藏季振宜《唐诗》一部发下，" +
            "作为校刊底本。同年五月，由曹寅主持，在扬州开局修书，参加校刊编修的有赋闲江南的在籍翰林官彭定求、" +
            "沈三曾、杨中讷、潘从律、汪士綋，徐树本、车鼎晋，汪绎、查嗣瑮、俞梅等十人。至次年十月，全书即编成奏上。" +
            "得诗四万八千九百余首，凡二千二百余人”， 共计900卷，目录12卷。(来自百科)";

    public static final String SONGCI_INTRO = "《全宋词》是中国近百年来最重要的古籍整理成果之一。宋词和唐诗均为中国古典诗的艺术高峰。清代所编《全唐诗》是家喻户晓籍，现又新编出《全宋词》，堪称中国文学的双璧。全书共五册，荟萃宋代三百年间的词作。 来自百科。宋词著名词人苏轼、辛弃疾、柳永、王安石、曾巩、欧阳询";

    public static final Integer TANG_POETRY = 1;

    public static final Integer SONG_CI = 2;

}
